test/test1_new.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="MeasuredDataPublication" lang="nl"><publicationTime>2019-02-03T20:03:42.012Z</publicationTime><publicationCreator><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></publicationCreator><measurementSiteTableReference id="NDW01_MT" version="1069" targetClass="MeasurementSiteTable"/><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><siteMeasurements xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><measurementSiteReference id="PZH01_MST_0690_00" version="4" targetClass="MeasurementSiteRecord"/><measurementTimeDefault>2019-02-03T20:02:00Z</measurementTimeDefault><measuredValue index="1"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>300</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="2"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="3"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="4"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>300</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="5"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="5" standardDeviation="3.97"><speed>53</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="6"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="7"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="8"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="5" standardDeviation="3.97"><speed>53</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="9"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>60</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="10"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="11"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="12"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>60</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="13"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="1"><speed>63</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="14"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="15"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="16"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="1"><speed>63</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue></siteMeasurements><siteMeasurements xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><measurementSiteReference id="PZH01_MST_0661_00" version="4" targetClass="MeasurementSiteRecord"/><measurementTimeDefault>2019-02-03T20:02:00Z</measurementTimeDefault><measuredValue index="1"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>120</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="2"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="3"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>0</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="4"><measuredValue><basicData xsi:type="TrafficFlow"><vehicleFlow><vehicleFlowRate>120</vehicleFlowRate></vehicleFlow></basicData></measuredValue></measuredValue><measuredValue index="5"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="2" standardDeviation="0.5"><speed>61</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="6"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="7"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="0"><speed>-1</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue><measuredValue index="8"><measuredValue><basicData xsi:type="TrafficSpeed"><averageVehicleSpeed numberOfInputValuesUsed="2" standardDeviation="0.5"><speed>61</speed></averageVehicleSpeed></basicData></measuredValue></measuredValue></siteMeasurements></payloadPublication></d2LogicalModel></SOAP:Body></SOAP:Envelope>